BAS BMEKZU Project/src/Documents/скEDI_ЗапросНаПолучениеЛимитаРегистрацииВЕРНН/скEDI_ЗапросНаПолучениеЛимитаРегистрацииВЕРНН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>скEDI_ЗапросНаПолучениеЛимитаРегистрацииВЕРНН</name>
  <registerRecords>InformationRegister.скEDI_ВипискиПоЛимитуРегистрацииВЕРНН</registerRecords>
  <attributes>
    <name>ОрганизацияEDI</name>
    <type>
      <types>CatalogRef.скEDI_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаДФС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КтоОформилЗапрос</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФормированияОтвета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияОтвета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклоненияДФС</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыпискаСтрока2Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоследняяОперация</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Подписи</name>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>CatalogRef.скEDI_Подписи</types>
        <types>CatalogRef.скEDI_ГруппыПодписей</types>
      </type>
    </attributes>
    <attributes>
      <name>Подписано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодписания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодписиКонтрагента</name>
    <attributes>
      <name>ТелоСертификата</name>
      <comment>Base64-строка, построенная на основании двоичных данных файла сертификата</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПодписанта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>511</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДолжностьПодписанта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подписано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодписания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодписьВерна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.скEDI_РолиПодписей</types>
      </type>
    </attributes>
    <attributes>
      <name>ДРФОПодписанта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТелоФаксимиле</name>
      <comment>Не используется</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>TSPСтатус</name>
      <type>
        <types>EnumRef.скEDI_TSPСтатус</types>
      </type>
    </attributes>
    <attributes>
      <name>OCSPСтатус</name>
      <type>
        <types>EnumRef.скEDI_OCSPСтатус</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/InformationRegisters/скEDI_ВипискиПоЛимитуРегистрацииВЕРНН/скEDI_ВипискиПоЛимитуРегистрацииВЕРНН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>скEDI_ВипискиПоЛимитуРегистрацииВЕРНН</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Строка2Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.скEDI_Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Enums/скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС/скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>ОтправленВДФС</name>
  </enumValues>
  <enumValues>
    <name>ПолученоКвитанциюОтДФС</name>
  </enumValues>
  <enumValues>
    <name>ПолученоПодтверждениеОтДФС</name>
  </enumValues>
  <enumValues>
    <name>ПолученоОтклонениеОтДФС</name>
  </enumValues>
  <enumValues>
    <name>ПолученоОтветОтДФС</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Enums/скEDI_ТипыСодержимогоДополнительныхЭлектронныхДокуметовДФС/скEDI_ТипыСодержимогоДополнительныхЭлектронныхДокуметовДФС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>скEDI_ТипыСодержимогоДополнительныхЭлектронныхДокуметовДФС</name>
  <enumValues>
    <name>Запрос</name>
  </enumValues>
  <enumValues>
    <name>Ответ</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Documents/скEDI_ЗапросНаПолучениеЛимитаРегистрацииВЕРНН/ObjectModule.bsl
Процедура ПередУдалением(Отказ)
	//Отказ = Не МонопольныйРежим();
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Состояние = Перечисления.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.Создан;
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Состояние = Перечисления.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.Создан;
	ИмяФайлаДФС = "";
	КтоОформилЗапрос = Неопределено;
	Подписи.Очистить();
	ВыпискаСтрока2Сумма = 0;
	ДатаОтправки = Неопределено;
	ДатаПолученияОтвета = Неопределено;
	ПричинаОтклоненияДФС = "";
КонецПроцедуры

Функция ЗагрузитьВытяг(ОрганизацияПолучатель, ДанныеДокумента, УзелDECLARHEAD, УзелDECLARBODY, ДатаСобытия) Экспорт
	тДатаВитягу = "";
	тВремяВитягу = "";
	тВыпискаСтрока2Сумма = "";
	Для Каждого ДочернийУзелDECLARBODY Из УзелDECLARBODY.ДочерниеУзлы Цикл
		Если ВРег(ДочернийУзелDECLARBODY.ИмяУзла) = ВРег("HFILL") Тогда
			тДатаВитягу = ДочернийУзелDECLARBODY.ТекстовоеСодержимое;
		ИначеЕсли ВРег(ДочернийУзелDECLARBODY.ИмяУзла) = ВРег("HTIME") Тогда
			тВремяВитягу = ДочернийУзелDECLARBODY.ТекстовоеСодержимое;
		ИначеЕсли ВРег(ДочернийУзелDECLARBODY.ИмяУзла) = ВРег("R02G03") Тогда
			тВыпискаСтрока2Сумма = ДочернийУзелDECLARBODY.ТекстовоеСодержимое;
		КонецЕсли;
	КонецЦикла;
	
	дГод = 0;
	дМесяц = 0;
	дДень = 0;
	Если скEDI_ОбщегоНазначения.ПолучитьГодМесяцДеньИзДатыФорматаДДММГГГГ(тДатаВитягу, дГод, дМесяц, дДень) Тогда
		дЧас = 0;
		дМинута = 0;
		дСекунда = 0;
		Если скEDI_ОбщегоНазначения.ПолучитьВремяФорматаЧЧММСС(тВремяВитягу, дЧас, дМинута, дСекунда) Тогда
			ДатаВремяВитягу = Дата(дГод, дМесяц, дДень, дЧас, дМинута, дСекунда);
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	ДатаФормированияОтвета = ДатаВремяВитягу;
	ДатаПолученияОтвета = ДатаСобытия;
	Если ЗначениеЗаполнено(тВыпискаСтрока2Сумма) Тогда
		ВыпискаСтрока2Сумма = Число(тВыпискаСтрока2Сумма);
	Иначе
		ВыпискаСтрока2Сумма = 0;
	КонецЕсли;
	
	Состояние = Перечисления.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.ПолученоОтветОтДФС;
	
	лМассивПодписей = скEDI_ОбщегоНазначения.ПолучитьМассивПодписейИзМассиваСоответствий(ДанныеДокумента.Получить("Signers"));
	//ИнформацияОПолученомДокументе = ИнформацияОПолученомДокументе + "
	//		|
	//		|Підписи:";
	//ДополнитьОписаниеДаннымиПоПодписямКонтрагента(лМассивПодписей, ИнформацияОПолученомДокументе, Неопределено, Ложь, Ложь);
	лМассивДанныхПоПодписямКонтрагента = скEDI_ОбщегоНазначения.СформироватьМассивДанныхПоПодписямКонтрагента(лМассивПодписей);
	Для Каждого лИнформацияОПодписи Из лМассивДанныхПоПодписямКонтрагента Цикл
		лНоваяСтрокаПодписиКонтрагента = ПодписиКонтрагента.Добавить();
		ЗаполнитьЗначенияСвойств(лНоваяСтрокаПодписиКонтрагента, лИнформацияОПодписи);
	КонецЦикла;
	
	Записать(РежимЗаписиДокумента.Проведение);
	
	скEDI_ВнешниеХранилища.СохранитьСодержимоеДополнительногоЭлектронногоДокументаДФС(Ссылка, Перечисления.скEDI_ТипыСодержимогоДополнительныхЭлектронныхДокуметовДФС.Ответ, ДанныеДокумента.Получить("Body"), "", ДатаСобытия);
	//СодержимоеЭлектронныхДокументовМенеджерЗаписи = РегистрыСведений.скEDI_СодержимоеДополнительныхЭлектронныхДокументовДФС.СоздатьМенеджерЗаписи();
	//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ЭлектронныйДокумент = Ссылка;
	//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ТипСодержимого = Перечисления.скEDI_ТипыСодержимогоДополнительныхЭлектронныхДокуметовДФС.Ответ;
	//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ТелоДокумента = ДанныеДокумента.Получить("Body");
	//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИзображениеДокумента = "";
	//СодержимоеЭлектронныхДокументовМенеджерЗаписи.Дата = ДатаСобытия;
	//СодержимоеЭлектронныхДокументовМенеджерЗаписи.Записать(Истина);
	Возврат Истина;
КонецФункции

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр скEDI_ВипискиПоЛимитуРегистрацииВЕРНН
	Движения.скEDI_ВипискиПоЛимитуРегистрацииВЕРНН.Записывать = Истина;
	Если Состояние = Перечисления.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.ПолученоОтветОтДФС Тогда
		Движение = Движения.скEDI_ВипискиПоЛимитуРегистрацииВЕРНН.Добавить();
		Движение.Организация = ОрганизацияEDI;
		Движение.Период = ДатаФормированияОтвета;
		Движение.Строка2Сумма = ВыпискаСтрока2Сумма;
	КонецЕсли;
КонецПроцедуры
